app/views/movies/show.html.erb

    </div>
    <% if @movie.user.length == 0 %>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1