app/controllers/movies_controller.rb

SELECT `movies`.* FROM `movies`
---
  def index
    @movies = Movie.all

INSERT INTO `movies` (`title`, `year`, `plot`, `genre`, `director`, `actors`, `poster`, `runtime`, `created_at`, `updated_at`) VALUES ('Tenet', '2020', 'Armed with only one word -- Tenet -- and fighting for the survival of the entire world, the Protagonist journeys through a twilight world of international espionage on a mission that will unfold in something beyond real time.', 'Action, Sci-Fi, Thriller', 'Christopher Nolan', 'John David Washington, Robert Pattinson, Elizabeth Debicki', 'https://m.media-amazon.com/images/M/MV5BNmMwYzFlNTEtYTc0NC00NGY4LTgzNzItZGFiYTViY2QzNzU1XkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_UX182_CR0,0,182,268_AL_.jpg', '150', '2020-06-01 14:07:43.720672', '2020-06-01 14:07:43.720672')
---
  def create
    @movie = Movie.create(params.require(:movie).permit(:title, :year, :genre, :plot, :director, :poster, :actors, :runtime))

SELECT `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1
---
  def show
    @movie = Movie.find(params[:id])