app/controllers/movies_controller.rb

  def show
    @movie = Movie.find(params[:id])
    @user = Array.new

    @movie.user.each do |user|
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1